Repository: kkoliou/Vocabulary
Catalog: Vocabulary/Shared/Sources/Shared/Localizable.xcstrings
Source language: en
Languages: el

source: Add
el: Προσθήκη

source: Add vocabulary
el: Προσθήκη λεξιλογίου

source: Cancel
el: Άκυρο

source: Choose a descriptive name to organize your learning.
el: Επίλεξε ένα περιγραφικό όνομα για να οργανώσεις τη μάθησή σου.

source: Create your first word list to start studying.
el: Δημιούργησε την πρώτη σου λίστα λέξεων για να ξεκινήσεις τη μελέτη.

source: New Vocabulary
el: Νέο Λεξιλόγιο

source: No vocabulary yet
el: Δεν υπάρχει ακόμη λεξιλόγιο

source: Provide a vocabulary name
el: Δώσε ένα όνομα στο λεξιλόγιο

source: Something went wrong
el: Κάτι πήγε στραβά

source: The vocabulary already exists
el: Το λεξιλόγιο υπάρχει ήδη

source: Vocabularies
el: Λεξιλόγιο

source: Vocabulary name
el: Όνομα λεξιλογίου

source: Word or phrase
el: Όνομα
